export const kruiChartNumberMock1 = [
  [1, 10],
  [2, 110],
  [3, 280],
  [4, 302],
  [5, 110],
  [6, 480],
  [7, 95]
] as [number, number][];

export const kruiChartNumberMock2 = [
  [1, 80],
  [2, 50],
  [3, 60],
  [4, 30],
  [5, 40],
  [6, 20],
  [7, 55]
] as [number, number][];

export const kruiChartNumberMock3 = [
  [1, 48],
  [2, 44],
  [3, 40],
  [4, 39],
  [5, 35],
  [6, 34],
  [7, 33],
  [8, 37],
  [9, 38],
  [10, 43]
] as [number, number][];

export const kruiChartNumberMock4 = [
  [1, 22],
  [2, 27],
  [3, 33],
  [4, 28],
  [5, 26],
  [6, 25],
  [7, 20],
  [8, 26],
  [9, 24],
  [10, 28]
] as [number, number][];

export const kruiChartNumberMockMissingValue1 = [
  [0, 40],
  [1, 35],
  [2, null],
  [3, null],
  [4, 40],
  [5, 50],
  [6, 30],
  [7, 65]
] as [number, number][];

export const kruiChartLineMockTime1 = [
  ['2022-01-01T00:00:00.0000000Z', 48],
  ['2022-02-01T00:00:00.0000000Z', 44],
  ['2022-03-01T00:00:00.0000000Z', 40],
  ['2022-04-01T00:00:00.0000000Z', 39],
  ['2022-05-01T00:00:00.0000000Z', 35],
  ['2022-06-01T00:00:00.0000000Z', 34],
  ['2022-07-01T00:00:00.0000000Z', 33],
  ['2022-08-01T00:00:00.0000000Z', 37],
  ['2022-09-01T00:00:00.0000000Z', 38],
  ['2022-10-01T00:00:00.0000000Z', 43],
  ['2022-11-01T00:00:00.0000000Z', 44],
  ['2022-12-01T00:00:00.0000000Z', 48]
] as [string, number][];

export const kruiChartLineMockTime2 = [
  ['2022-01-01T00:00:00.0000000Z', 55],
  ['2022-02-01T00:00:00.0000000Z', 50],
  ['2022-03-01T00:00:00.0000000Z', 44],
  ['2022-04-01T00:00:00.0000000Z', 47],
  ['2022-05-01T00:00:00.0000000Z', 41],
  ['2022-06-01T00:00:00.0000000Z', 43],
  ['2022-07-01T00:00:00.0000000Z', 48],
  ['2022-08-01T00:00:00.0000000Z', 50],
  ['2022-09-01T00:00:00.0000000Z', 52],
  ['2022-10-01T00:00:00.0000000Z', 57],
  ['2022-11-01T00:00:00.0000000Z', 55],
  ['2022-12-01T00:00:00.0000000Z', 54]
] as [string, number][];

export const kruiChartLineMockTime3 = [
  ['2022-12-07T09:03:00.0000000Z', 11],
  ['2022-12-07T09:02:40.0000000Z', 22],
  ['2022-12-07T09:02:20.0000000Z', 45],
  ['2022-12-07T09:02:00.0000000Z', 113],
  ['2022-12-07T09:01:40.0000000Z', 88],
  ['2022-12-07T09:01:20.0000000Z', 21],
  ['2022-12-07T09:01:00.0000000Z', 95],
  ['2022-12-07T09:00:40.0000000Z', 54],
  ['2022-12-07T09:00:20.0000000Z', 12],
  ['2022-12-07T09:00:00.0000000Z', 25],
  ['2022-12-07T08:59:40.0000000Z', 29],
  ['2022-12-07T08:59:20.0000000Z', 22],
  ['2022-12-07T08:59:00.0000000Z', 64],
  ['2022-12-07T08:58:40.0000000Z', 99],
  ['2022-12-07T08:58:20.0000000Z', 67],
  ['2022-12-07T08:58:00.0000000Z', 47],
  ['2022-12-07T08:57:40.0000000Z', 17],
  ['2022-12-07T08:57:20.0000000Z', 121],
  ['2022-12-07T08:57:00.0000000Z', 122],
  ['2022-12-07T08:56:40.0000000Z', 87],
  ['2022-12-07T08:56:20.0000000Z', 92],
  ['2022-12-07T08:56:00.0000000Z', 108],
  ['2022-12-07T08:55:40.0000000Z', 5],
  ['2022-12-07T08:55:20.0000000Z', 74],
  ['2022-12-07T08:55:00.0000000Z', 115],
  ['2022-12-07T08:54:40.0000000Z', 13],
  ['2022-12-07T08:54:20.0000000Z', 106],
  ['2022-12-07T08:54:00.0000000Z', 87],
  ['2022-12-07T08:53:40.0000000Z', 70],
  ['2022-12-07T08:53:20.0000000Z', 22]
] as [string, number][];

export const kruiChartLineEnumMock1 = [
  [1, 48, null, 'Знач. 1'],
  [2, 44, null, 'Знач. 2'],
  [3, 40, null, 'Знач. 3'],
  [4, 39, null, 'Знач. 4'],
  [5, 35, null, 'Знач. 5'],
  [6, 34, null, 'Знач. 6'],
  [7, 33, null, 'Знач. 7'],
  [8, 37, null, 'Знач. 8'],
  [9, 38, null, 'Знач. 9'],
  [10, 43, null, 'Знач. 10']
] as [number | string | Date, number, string | null, string][];

export const kruiChartBarEnumMock1 = [
  [1, 48, 'Зн. 1'],
  [2, 44, 'Зн. 2'],
  [3, 40, 'Зн. 3'],
  [4, 39, 'Зн. 4'],
  [5, 35, 'Зн. 5'],
  [6, 34, 'Зн. 6'],
  [7, 33, 'Зн. 7'],
  [8, 37, 'Зн. 8'],
  [9, 38, 'Зн. 9'],
  [10, 43, 'Зн. 10']
] as [number, number, string][];

export const kruiChartBarEnumMock2 = [
  [1, 22, '1'],
  [2, 27, '2'],
  [3, 33, '3'],
  [4, 28, '4'],
  [5, 26, '5'],
  [6, 25, '6'],
  [7, 20, '7'],
  [8, 26, '8'],
  [9, 24, '9'],
  [10, 28, '10']
] as [number, number, string][];

export const kruiChartBarEnumMock3 = [
  [1, 34, 'Зн. 1'],
  [2, 33, 'Зн. 2'],
  [3, 36, 'Зн. 3'],
  [4, 35, 'Зн. 4'],
  [5, 33, 'Зн. 5'],
  [6, 38, 'Зн. 6'],
  [7, 33, 'Зн. 7'],
  [8, 39, 'Зн. 8'],
  [9, 36, 'Зн. 9'],
  [10, 32, 'Зн. 10']
] as [number, number, string][];

export const kruiChartStackBarMock1 = [
  [1, [48, 22, 34], 'Зн. 1'],
  [2, [44, 27, 29], 'Зн. 2'],
  [3, [22, 33, 49], 'Зн. 3'],
  [4, [27, 28, 35], 'Зн. 4'],
  [5, [35, 26, 33], 'Зн. 5']
] as [number, any[], string][];

export const kruiChartStackBarMock2 = [
  [0, [20, 30, 40], 'Показатель 0'],
  [1, [10, 20, 30], 'Показатель 1'],
  [2, [110, 100, 90], 'Показатель 2'],
  [3, [280, 220, 100], 'Показатель 3'],
  [4, [10, 170, 20], 'Показатель 4'],
  [5, [110, 90, 100], 'Показатель 5'],
  [6, [100, 10, 200], 'Показатель 6'],
  [7, [95, 100, 20], 'Показатель 7']
] as [number, any[], string][];

export const kruiChartRangeBarMock1 = [
  [0, [20, 30], 'Показатель 0'],
  [1, [10, 20], 'Показатель 1'],
  [2, [110, 100], 'Показатель 2'],
  [3, [280, 220], 'Показатель 3'],
  [4, [10, 170], 'Показатель 4'],
  [5, [110, 90], 'Показатель 5'],
  [6, [100, 10], 'Показатель 6'],
  [7, [95, 100], 'Показатель 7']
] as [number, [number, number], string][];

export const kruiChartRangeBarMock2 = [
  [0, [30, 40], 'Показатель 0'],
  [1, [20, 30], 'Показатель 1'],
  [2, [100, 90], 'Показатель 2'],
  [3, [220, 100], 'Показатель 3'],
  [4, [170, 20], 'Показатель 4'],
  [5, [90, 100], 'Показатель 5'],
  [6, [10, 200], 'Показатель 6'],
  [7, [100, 20], 'Показатель 7']
] as [number, [number, number], string][];

export const kruiChartRangeBarStackMock = [
  [0, [[20, 30], [30, 40]], 'Показатель 0'],
  [1, [[10, 20], [20, 30]], 'Показатель 1'],
  [2, [[110, 100], [100, 90]], 'Показатель 2'],
  [3, [[280, 220], [220, 100]], 'Показатель 3'],
  [4, [[10, 170], [170, 20]], 'Показатель 4'],
  [5, [[110, 90], [90, 100]], 'Показатель 5'],
  [6, [[100, 10], [10, 200]], 'Показатель 6'],
  [7, [[95, 100], [100, 20]], 'Показатель 7']
] as [number, [number, number][], string][];

export const kruiChartStackBarMissingValueMock1 = [
  [0, [20, null, 40], 'Показатель 0'],
  [1, [10, 20, 30], 'Показатель 1'],
  [2, [110, null, null], 'Показатель 2'],
  [3, [280, 220, 100], 'Показатель 3'],
  [4, [10, null, 20], 'Показатель 4'],
  [5, [110, 90, 100], 'Показатель 5'],
  [6, [null, 10, 200], 'Показатель 6'],
  [7, [95, 100, 20], 'Показатель 7']
] as [number, any[], string][];
